garyPenhook/PIC-Assembler/device_includes/pic16f18154.inc
// Register: DAC2DATL
#define DAC2DATL DAC2DATL
DAC2DATL                                 equ 0891h
// bitfield definitions
DAC2DATL_DAC2R_POSN                      equ 0000h
DAC2DATL_DAC2R_POSITION                  equ 0000h
DAC2DATL_DAC2R_SIZE                      equ 0008h
DAC2DATL_DAC2R_LENGTH                    equ 0008h
DAC2DATL_DAC2R_MASK                      equ 00FFh
DAC2DATL_DAT_POSN                        equ 0000h
DAC2DATL_DAT_POSITION                    equ 0000h
DAC2DATL_DAT_SIZE                        equ 0008h
DAC2DATL_DAT_LENGTH                      equ 0008h
DAC2DATL_DAT_MASK                        equ 00FFh

// Register: PWM3ERS
#define PWM3ERS PWM3ERS
PWM3ERS                                  equ 098Ch
// bitfield definitions
PWM3ERS_ERS_POSN                         equ 0000h
PWM3ERS_ERS_POSITION                     equ 0000h
PWM3ERS_ERS_SIZE                         equ 0008h
PWM3ERS_ERS_LENGTH                       equ 0008h
PWM3ERS_ERS_MASK                         equ 00FFh
PWM3ERS_ERS0_POSN                        equ 0000h
PWM3ERS_ERS0_POSITION                    equ 0000h
PWM3ERS_ERS0_SIZE                        equ 0001h
PWM3ERS_ERS0_LENGTH                      equ 0001h
PWM3ERS_ERS0_MASK                        equ 0001h
PWM3ERS_ERS1_POSN                        equ 0001h
PWM3ERS_ERS1_POSITION                    equ 0001h
PWM3ERS_ERS1_SIZE                        equ 0001h
PWM3ERS_ERS1_LENGTH                      equ 0001h
PWM3ERS_ERS1_MASK                        equ 0002h
PWM3ERS_ERS2_POSN                        equ 0002h
PWM3ERS_ERS2_POSITION                    equ 0002h
PWM3ERS_ERS2_SIZE                        equ 0001h
PWM3ERS_ERS2_LENGTH                      equ 0001h
PWM3ERS_ERS2_MASK                        equ 0004h
PWM3ERS_ERS3_POSN                        equ 0003h
PWM3ERS_ERS3_POSITION                    equ 0003h
PWM3ERS_ERS3_SIZE                        equ 0001h
PWM3ERS_ERS3_LENGTH                      equ 0001h
PWM3ERS_ERS3_MASK                        equ 0008h

// Register: PWM3CLK
#define PWM3CLK PWM3CLK
PWM3CLK                                  equ 098Dh
// bitfield definitions
PWM3CLK_CLK_POSN                         equ 0000h
PWM3CLK_CLK_POSITION                     equ 0000h
PWM3CLK_CLK_SIZE                         equ 0008h
PWM3CLK_CLK_LENGTH                       equ 0008h
PWM3CLK_CLK_MASK                         equ 00FFh
PWM3CLK_CLK0_POSN                        equ 0000h
PWM3CLK_CLK0_POSITION                    equ 0000h
PWM3CLK_CLK0_SIZE                        equ 0001h
PWM3CLK_CLK0_LENGTH                      equ 0001h
PWM3CLK_CLK0_MASK                        equ 0001h
PWM3CLK_CLK1_POSN                        equ 0001h
PWM3CLK_CLK1_POSITION                    equ 0001h
PWM3CLK_CLK1_SIZE                        equ 0001h
PWM3CLK_CLK1_LENGTH                      equ 0001h
PWM3CLK_CLK1_MASK                        equ 0002h
PWM3CLK_CLK2_POSN                        equ 0002h
PWM3CLK_CLK2_POSITION                    equ 0002h
PWM3CLK_CLK2_SIZE                        equ 0001h
PWM3CLK_CLK2_LENGTH                      equ 0001h
PWM3CLK_CLK2_MASK                        equ 0004h
PWM3CLK_CLK3_POSN                        equ 0003h
PWM3CLK_CLK3_POSITION                    equ 0003h
PWM3CLK_CLK3_SIZE                        equ 0001h
PWM3CLK_CLK3_LENGTH                      equ 0001h
PWM3CLK_CLK3_MASK                        equ 0008h

// Register: PWM3LDS
#define PWM3LDS PWM3LDS
PWM3LDS                                  equ 098Eh
// bitfield definitions
PWM3LDS_LDS_POSN                         equ 0000h
PWM3LDS_LDS_POSITION                     equ 0000h
PWM3LDS_LDS_SIZE                         equ 0008h
PWM3LDS_LDS_LENGTH                       equ 0008h
PWM3LDS_LDS_MASK                         equ 00FFh
PWM3LDS_LDS0_POSN                        equ 0000h
PWM3LDS_LDS0_POSITION                    equ 0000h
PWM3LDS_LDS0_SIZE                        equ 0001h
PWM3LDS_LDS0_LENGTH                      equ 0001h
PWM3LDS_LDS0_MASK                        equ 0001h
PWM3LDS_LDS1_POSN                        equ 0001h
PWM3LDS_LDS1_POSITION                    equ 0001h
PWM3LDS_LDS1_SIZE                        equ 0001h
PWM3LDS_LDS1_LENGTH                      equ 0001h
PWM3LDS_LDS1_MASK                        equ 0002h
PWM3LDS_LDS2_POSN                        equ 0002h
PWM3LDS_LDS2_POSITION                    equ 0002h
PWM3LDS_LDS2_SIZE                        equ 0001h
PWM3LDS_LDS2_LENGTH                      equ 0001h
PWM3LDS_LDS2_MASK                        equ 0004h

// Register: PWM3PRL
#define PWM3PRL PWM3PRL
PWM3PRL                                  equ 098Fh
// bitfield definitions
PWM3PRL_PRL_POSN                         equ 0000h
PWM3PRL_PRL_POSITION                     equ 0000h
PWM3PRL_PRL_SIZE                         equ 0008h
PWM3PRL_PRL_LENGTH                       equ 0008h
PWM3PRL_PRL_MASK                         equ 00FFh

// Register: PWM3PRH
#define PWM3PRH PWM3PRH
PWM3PRH                                  equ 0990h
// bitfield definitions
PWM3PRH_PRH_POSN                         equ 0000h
PWM3PRH_PRH_POSITION                     equ 0000h
PWM3PRH_PRH_SIZE                         equ 0008h
PWM3PRH_PRH_LENGTH                       equ 0008h
PWM3PRH_PRH_MASK                         equ 00FFh

// Register: PWM3CPRE
#define PWM3CPRE PWM3CPRE
PWM3CPRE                                 equ 0991h
// bitfield definitions
PWM3CPRE_CPRE_POSN                       equ 0000h
PWM3CPRE_CPRE_POSITION                   equ 0000h
PWM3CPRE_CPRE_SIZE                       equ 0008h
PWM3CPRE_CPRE_LENGTH                     equ 0008h
PWM3CPRE_CPRE_MASK                       equ 00FFh

// Register: PWM3PIPOS
#define PWM3PIPOS PWM3PIPOS
PWM3PIPOS                                equ 0992h
// bitfield definitions
PWM3PIPOS_PIPOS_POSN                     equ 0000h
PWM3PIPOS_PIPOS_POSITION                 equ 0000h
PWM3PIPOS_PIPOS_SIZE                     equ 0008h
PWM3PIPOS_PIPOS_LENGTH                   equ 0008h
PWM3PIPOS_PIPOS_MASK                     equ 00FFh

