garyPenhook/PIC-Assembler/device_includes/pic16f18154.inc
// Register: PWM3S1P2H
#define PWM3S1P2H PWM3S1P2H
PWM3S1P2H                                equ 099Ah
// bitfield definitions
PWM3S1P2H_P2H_POSN                       equ 0000h
PWM3S1P2H_P2H_POSITION                   equ 0000h
PWM3S1P2H_P2H_SIZE                       equ 0008h
PWM3S1P2H_P2H_LENGTH                     equ 0008h
PWM3S1P2H_P2H_MASK                       equ 00FFh
PWM3S1P2H_S1P2H_POSN                     equ 0000h
PWM3S1P2H_S1P2H_POSITION                 equ 0000h
PWM3S1P2H_S1P2H_SIZE                     equ 0008h
PWM3S1P2H_S1P2H_LENGTH                   equ 0008h
PWM3S1P2H_S1P2H_MASK                     equ 00FFh

// Register: PWM4ERS
#define PWM4ERS PWM4ERS
PWM4ERS                                  equ 0A0Ch
// bitfield definitions
PWM4ERS_ERS_POSN                         equ 0000h
PWM4ERS_ERS_POSITION                     equ 0000h
PWM4ERS_ERS_SIZE                         equ 0008h
PWM4ERS_ERS_LENGTH                       equ 0008h
PWM4ERS_ERS_MASK                         equ 00FFh
PWM4ERS_ERS0_POSN                        equ 0000h
PWM4ERS_ERS0_POSITION                    equ 0000h
PWM4ERS_ERS0_SIZE                        equ 0001h
PWM4ERS_ERS0_LENGTH                      equ 0001h
PWM4ERS_ERS0_MASK                        equ 0001h
PWM4ERS_ERS1_POSN                        equ 0001h
PWM4ERS_ERS1_POSITION                    equ 0001h
PWM4ERS_ERS1_SIZE                        equ 0001h
PWM4ERS_ERS1_LENGTH                      equ 0001h
PWM4ERS_ERS1_MASK                        equ 0002h
PWM4ERS_ERS2_POSN                        equ 0002h
PWM4ERS_ERS2_POSITION                    equ 0002h
PWM4ERS_ERS2_SIZE                        equ 0001h
PWM4ERS_ERS2_LENGTH                      equ 0001h
PWM4ERS_ERS2_MASK                        equ 0004h
PWM4ERS_ERS3_POSN                        equ 0003h
PWM4ERS_ERS3_POSITION                    equ 0003h
PWM4ERS_ERS3_SIZE                        equ 0001h
PWM4ERS_ERS3_LENGTH                      equ 0001h
PWM4ERS_ERS3_MASK                        equ 0008h

// Register: PWM4CLK
#define PWM4CLK PWM4CLK
PWM4CLK                                  equ 0A0Dh
// bitfield definitions
PWM4CLK_CLK_POSN                         equ 0000h
PWM4CLK_CLK_POSITION                     equ 0000h
PWM4CLK_CLK_SIZE                         equ 0008h
PWM4CLK_CLK_LENGTH                       equ 0008h
PWM4CLK_CLK_MASK                         equ 00FFh
PWM4CLK_CLK0_POSN                        equ 0000h
PWM4CLK_CLK0_POSITION                    equ 0000h
PWM4CLK_CLK0_SIZE                        equ 0001h
PWM4CLK_CLK0_LENGTH                      equ 0001h
PWM4CLK_CLK0_MASK                        equ 0001h
PWM4CLK_CLK1_POSN                        equ 0001h
PWM4CLK_CLK1_POSITION                    equ 0001h
PWM4CLK_CLK1_SIZE                        equ 0001h
PWM4CLK_CLK1_LENGTH                      equ 0001h
PWM4CLK_CLK1_MASK                        equ 0002h
PWM4CLK_CLK2_POSN                        equ 0002h
PWM4CLK_CLK2_POSITION                    equ 0002h
PWM4CLK_CLK2_SIZE                        equ 0001h
PWM4CLK_CLK2_LENGTH                      equ 0001h
PWM4CLK_CLK2_MASK                        equ 0004h
PWM4CLK_CLK3_POSN                        equ 0003h
PWM4CLK_CLK3_POSITION                    equ 0003h
PWM4CLK_CLK3_SIZE                        equ 0001h
PWM4CLK_CLK3_LENGTH                      equ 0001h
PWM4CLK_CLK3_MASK                        equ 0008h

// Register: PWM4LDS
#define PWM4LDS PWM4LDS
PWM4LDS                                  equ 0A0Eh
// bitfield definitions
PWM4LDS_LDS_POSN                         equ 0000h
PWM4LDS_LDS_POSITION                     equ 0000h
PWM4LDS_LDS_SIZE                         equ 0008h
PWM4LDS_LDS_LENGTH                       equ 0008h
PWM4LDS_LDS_MASK                         equ 00FFh
PWM4LDS_LDS0_POSN                        equ 0000h
PWM4LDS_LDS0_POSITION                    equ 0000h
PWM4LDS_LDS0_SIZE                        equ 0001h
PWM4LDS_LDS0_LENGTH                      equ 0001h
PWM4LDS_LDS0_MASK                        equ 0001h
PWM4LDS_LDS1_POSN                        equ 0001h
PWM4LDS_LDS1_POSITION                    equ 0001h
PWM4LDS_LDS1_SIZE                        equ 0001h
PWM4LDS_LDS1_LENGTH                      equ 0001h
PWM4LDS_LDS1_MASK                        equ 0002h
PWM4LDS_LDS2_POSN                        equ 0002h
PWM4LDS_LDS2_POSITION                    equ 0002h
PWM4LDS_LDS2_SIZE                        equ 0001h
PWM4LDS_LDS2_LENGTH                      equ 0001h
PWM4LDS_LDS2_MASK                        equ 0004h

// Register: PWM4PRL
#define PWM4PRL PWM4PRL
PWM4PRL                                  equ 0A0Fh
// bitfield definitions
PWM4PRL_PRL_POSN                         equ 0000h
PWM4PRL_PRL_POSITION                     equ 0000h
PWM4PRL_PRL_SIZE                         equ 0008h
PWM4PRL_PRL_LENGTH                       equ 0008h
PWM4PRL_PRL_MASK                         equ 00FFh

// Register: PWM4PRH
#define PWM4PRH PWM4PRH
PWM4PRH                                  equ 0A10h
// bitfield definitions
PWM4PRH_PRH_POSN                         equ 0000h
PWM4PRH_PRH_POSITION                     equ 0000h
PWM4PRH_PRH_SIZE                         equ 0008h
PWM4PRH_PRH_LENGTH                       equ 0008h
PWM4PRH_PRH_MASK                         equ 00FFh

// Register: PWM4CPRE
#define PWM4CPRE PWM4CPRE
PWM4CPRE                                 equ 0A11h
// bitfield definitions
PWM4CPRE_CPRE_POSN                       equ 0000h
PWM4CPRE_CPRE_POSITION                   equ 0000h
PWM4CPRE_CPRE_SIZE                       equ 0008h
PWM4CPRE_CPRE_LENGTH                     equ 0008h
PWM4CPRE_CPRE_MASK                       equ 00FFh

// Register: PWM4PIPOS
#define PWM4PIPOS PWM4PIPOS
PWM4PIPOS                                equ 0A12h
// bitfield definitions
PWM4PIPOS_PIPOS_POSN                     equ 0000h
PWM4PIPOS_PIPOS_POSITION                 equ 0000h
PWM4PIPOS_PIPOS_SIZE                     equ 0008h
PWM4PIPOS_PIPOS_LENGTH                   equ 0008h
PWM4PIPOS_PIPOS_MASK                     equ 00FFh

// Register: PWM4GIR
#define PWM4GIR PWM4GIR
PWM4GIR                                  equ 0A13h
// bitfield definitions
PWM4GIR_S1P1_POSN                        equ 0000h
PWM4GIR_S1P1_POSITION                    equ 0000h
PWM4GIR_S1P1_SIZE                        equ 0001h
PWM4GIR_S1P1_LENGTH                      equ 0001h
PWM4GIR_S1P1_MASK                        equ 0001h
PWM4GIR_S1P2_POSN                        equ 0001h
PWM4GIR_S1P2_POSITION                    equ 0001h
PWM4GIR_S1P2_SIZE                        equ 0001h
PWM4GIR_S1P2_LENGTH                      equ 0001h
PWM4GIR_S1P2_MASK                        equ 0002h
PWM4GIR_S1P1IF_POSN                      equ 0000h
PWM4GIR_S1P1IF_POSITION                  equ 0000h
PWM4GIR_S1P1IF_SIZE                      equ 0001h
PWM4GIR_S1P1IF_LENGTH                    equ 0001h
PWM4GIR_S1P1IF_MASK                      equ 0001h
PWM4GIR_S1P2IF_POSN                      equ 0001h
PWM4GIR_S1P2IF_POSITION                  equ 0001h
PWM4GIR_S1P2IF_SIZE                      equ 0001h
PWM4GIR_S1P2IF_LENGTH                    equ 0001h
PWM4GIR_S1P2IF_MASK                      equ 0002h

// Register: PWM4GIE
#define PWM4GIE PWM4GIE
PWM4GIE                                  equ 0A14h
// bitfield definitions
PWM4GIE_S1P1_POSN                        equ 0000h
PWM4GIE_S1P1_POSITION                    equ 0000h
PWM4GIE_S1P1_SIZE                        equ 0001h
PWM4GIE_S1P1_LENGTH                      equ 0001h
PWM4GIE_S1P1_MASK                        equ 0001h
PWM4GIE_S1P2_POSN                        equ 0001h
PWM4GIE_S1P2_POSITION                    equ 0001h
PWM4GIE_S1P2_SIZE                        equ 0001h
PWM4GIE_S1P2_LENGTH                      equ 0001h
PWM4GIE_S1P2_MASK                        equ 0002h
PWM4GIE_S1P1IE_POSN                      equ 0000h
PWM4GIE_S1P1IE_POSITION                  equ 0000h
PWM4GIE_S1P1IE_SIZE                      equ 0001h
PWM4GIE_S1P1IE_LENGTH                    equ 0001h
PWM4GIE_S1P1IE_MASK                      equ 0001h
PWM4GIE_S1P2IE_POSN                      equ 0001h
PWM4GIE_S1P2IE_POSITION                  equ 0001h
PWM4GIE_S1P2IE_SIZE                      equ 0001h
PWM4GIE_S1P2IE_LENGTH                    equ 0001h
PWM4GIE_S1P2IE_MASK                      equ 0002h

